{
  "basics": {
    "name": "T.J. Trimble",
    "label": "Linguist",
    "location": {
      "city": "Seattle",
      "region": "WA"
    },
    "summary": "I'm a Linguist and Software Engineer based in Seattle with a background in Natural Language Processing, including Speech Recognition, Natural Language Understanding, and Information Retrieval, with over a decade of programming experience. I have project management experience developing critical features with diverse partners supporting product launches like Meta Portal and Ray-Ban Stories. I'm focused on driving data-driven improvements, managing teams, and shaping the future of language technology."
  },
  "meta": {
    "theme": "full"
  },
  "work": [
    {
      "position": "Senior Linguist",
      "name": "Meta",
      "location": "Seattle, WA",
      "startDate": "2019-05-27",
      "summary": "Acted as linguistic project lead for major organization initiatives, developing linguistic foundation and future for Facebook Assistant on Ray-Ban Stories, Meta Quest, and Meta Portal, shipping four open source NLU data sets.",
      "highlights": [
        "Worked with many partners to develop the schema, ontology, and guidelines for tree-based NLU (TOP) from inception through product delivery, enabling the launch of Hey Facebook.",
        "Developed and maintained model-based and rule-based NLU systems and grammars, improving system accuracy to 95% on complex, multifaceted Q&A domains.",
        "Developed and maintained ASR language models, grammars, and other components, reducing Word Error Rates on several domains including on search dictation by 50%.",
        "Wrote and maintained data creation, curation, and annotation guidelines for projects across the stack including ASR, NLU, Q&A, Search, and NLG, used in the collection of millions of rows of data.",
        "Designed, iterated upon, and shipped new end to end features with my product team such as semantic search, increasing total search-driven revenue by 2% in one quarter.",
        "Managed a $10 million annual budget delivering quality data for several high impact domains including  app search, calling, messaging, reminders, open Q&A, and social across the entire stack, from ASR and NLU to NLG.",
        "Led a team of Linguists delivering exceptional products on Meta Quest, Meta Portal, and more, owning ASR and NLU components and managing data collections for several search modules.",
        "Worked with Product Managers, Engineering Managers, and Technology Leads from across the product pipeline (ASR, NLU, Q&A, NLG, etc.) to create project goals, prepare technical plans, and execute.",
        "Coordinated work with other teams across the product pipeline, from speech recognition (ASR) through language understanding (NLU) to text to speech (TTS), and built internal and external relationships.",
        "Managed direct reports, project teams, and directed up to one hundred annotators to exceed top level organizational objectives of end-to-end system quality.",
        "Developed individuals' technical and soft skills through project leadership, goal setting, and mentoring.",
        "Drove improvements across the product stack through data-driven opportunity analysis and aligning stakeholders around common goals.",
        "Drove improvements in ASR and NLU development processes across the organization, improving top line quality in some domains from 85% to 95% (-65% error).",
        "Triaged high visibility bug traffic through data-driven blame processes to get alignment on priorities.",
        "Created and developed hiring goals, job postings, core competencies, and interview questions.",
        "Conducted dozens of interviews, additionally acting as hiring coordinator for dozens of contractors.",
        "Developed technical and non-technical roles in collaboration with key stakeholders and peers."
      ]
    },
    {
      "position": "Linguistic Tools Engineering Lead",
      "name": "PRO Unlimited @ Facebook",
      "location": "Seattle, WA",
      "startDate": "2018-01-08",
      "endDate": "2019-05-26",
      "summary": "Led a four person engineering team to develop tools for ontology development, data annotation, quality management, and metrics.",
      "highlights": [
        "Developed CLI and web-based tools for ontology development, annotation quality, data quality, annotator training, inter-annotator agreement and model metrics, guidelines management, and annotation visualization in Python, PHP/Hack, and JavaScript/React.",
        "Worked with highly cross-functional team to implement a zero-to-one voice app management system with complex UX design, storage budget, and system design constraints, supporting the refresh of wit.ai",
        "Designed and implemented annotation tools for collection and annotation tasks for NLP in React and Hack used to collect millions of annotations by hundreds of annotators across dozens of projects.",
        "Led a four person engineering team, leading design discussions, organizing projects and workloads, and providing technical leadership and mentorship.",
        "Coordinated with other teams, built internal and external relationships, and developed individuals' skills.",
        "Consulted on contracts for Quality Assurance and technical requirements.",
        "Created and developed hiring goals, job postings, core competencies, and interview questions for technical and non-technical roles in collaboration with key stake holders and peers.",
        "Conducted and reviewed dozens of interviews."
      ]
    },
    {
      "position": "Linguist",
      "name": "Appen @ Facebook",
      "location": "Seattle, WA",
      "startDate": "2017-07-17",
      "endDate": "2018-01-07",
      "summary": "Ontologist, annotator, and developer supporting digital assistant annotation workflows for Natural Language Understanding.",
      "highlights": [
        "Worked closely with client to develop schema, ontology, and guidelines for tree-based, task oriented semantic annotation (TOP) from model inception through product delivery of Meta Portal.",
        "Annotated open class Q&A, navigation, and communications domain data with dependency parses and TOP labels.",
        "Developed tools to improve annotation quality and speed, including a custom annotation UI and annotation validators."
      ]
    },
    {
      "position": "Natural Language Processing Engineer",
      "name": "FirstRain",
      "location": "San Mateo, CA",
      "startDate": "2015-04-06",
      "endDate": "2016-10-07",
      "summary": "Led the injection of NLP techniques across several products, owning the delivery of high value, top of app content to top clients.",
      "highlights": [
        "Owned and improved an Information Extraction engine processing thousands of documents every day, built on top of Stanford's TokensRegex system.",
        "Designed, developed, and deployed a system matching named entities with topics over 100,000 documents per day."
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Washington",
      "area": "Computational Linguistics",
      "studyType": "Master of Science",
      "startDate": "2012-09-24",
      "endDate": "2014-12-05",
      "courses": [
        "Natural Language Processing: tokenization, POS tagging, chunking, parsing, word sense disambiguation, sentiment analysis, coreference resolution, etc. using FSA/FSTs, CKY, etc.",
        "Machine Learning: classification, clustering, and sequence labeling using Neural Networks (DNN, CNN, RNN, etc.), Naïve Bayes, MaxEnt/Logistic Regression, K-means, etc."
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Native"
    },
    {
      "language": "French",
      "fluency": "Intermediate"
    },
    {
      "language": "Japanese",
      "fluency": "Beginner"
    }
  ],
  "skills": [
    {
      "name": "Programming",
      "level": "13 years",
      "keywords": [
        "Python",
        "JavaScript/React",
        "PHP/Hack",
        "Java"
      ]
    },
    {
      "name": "NLP+ML",
      "level": "11 years",
      "keywords": [
        "NLTK",
        "NumPy",
        "pandas",
        "Stanford coreNLP",
        "TensorFlow"
      ]
    },
    {
      "name": "VCS",
      "level": "12 years",
      "keywords": [
        "git",
        "svn",
        "mercurial"
      ]
    },
    {
      "name": "IDE",
      "level": "12 years",
      "keywords": [
        "VS Code",
        "Atom/Nuclide",
        "Eclipse"
      ]
    }
  ],
  "publications": [
    {
      "name": "20 years of the Grammar Matrix: cross-linguistic hypothesis testing of increasingly complex interactions",
      "publisher": "Journal of Language Modelling",
      "releaseDate": "2022-10-20",
      "url": "https://jlm.ipipan.waw.pl/index.php/JLM/article/download/292/263",
      "summary": "A ten year summary paper describing how the Grammar Matrix grew in the last decade and describing how new additions to the system have made it possible to study interactions between analyses, both monolingually and cross-linguistically, at new levels of complexity."
    },
    {
      "name": "Adjectives in the LinGO Grammar Matrix",
      "releaseDate": "2014-12-12",
      "url": "https://digital.lib.washington.edu/researchworks/bitstream/handle/1773/27512/Trimble_washington_0250O_12797.pdf?sequence=1&isAllowed=y",
      "summary": "A new open source grammar engineering resource for adjectives using HPSG, considering both attributive and predicative constructions, editing and extending the Grammar Matrix core grammar while adding additional capabilities to the online customization system."
    }
  ],
  "projects": [
    {
      "name": "Grammar Matrix",
      "description": "An open source toolkit for the development of broad-coverage, precision, implemented grammars for diverse languages.",
      "summary": "Contributed to direction, regression testing code, serialization format, and more.",
      "startDate": "2013-09-25",
      "url": "http://matrix.delph-in.net/",
      "roles": [
        "contributor",
        "evangelist"
      ]
    }
  ]
}
